---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.Reset
source: html/28ddd8cf-9983-4e8e-cb9c-5b63c86cdd48.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```